{"modelTopology":{"class_name":"Model","config":{"name":"model132","layers":[{"name":"input132","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input132"},"inbound_nodes":[]},{"name":"dense_Dense602","class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense602","trainable":true},"inbound_nodes":[[["input132",0,0,{}]]]},{"name":"dense_Dense603","class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense603","trainable":true},"inbound_nodes":[[["dense_Dense602",0,0,{}]]]},{"name":"dense_Dense604","class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense604","trainable":true},"inbound_nodes":[[["dense_Dense603",0,0,{}]]]},{"name":"dense_Dense605","class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense605","trainable":true},"inbound_nodes":[[["dense_Dense604",0,0,{}]]]},{"name":"dense_Dense606","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense606","trainable":true},"inbound_nodes":[[["dense_Dense605",0,0,{}]]]}],"input_layers":[["input132",0,0]],"output_layers":[["dense_Dense606",0,0]]},"keras_version":"tfjs-layers 3.7.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense602/kernel","shape":[3,5],"dtype":"float32"},{"name":"dense_Dense602/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense603/kernel","shape":[5,5],"dtype":"float32"},{"name":"dense_Dense603/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense604/kernel","shape":[5,5],"dtype":"float32"},{"name":"dense_Dense604/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense605/kernel","shape":[5,5],"dtype":"float32"},{"name":"dense_Dense605/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense606/kernel","shape":[5,1],"dtype":"float32"},{"name":"dense_Dense606/bias","shape":[1],"dtype":"float32"}]}]}