{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["dense_Dense11",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["dense_Dense12",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["dense_Dense13",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["dense_Dense14",0,0,{}]]]}],"input_layers":[["input3",0,0]],"output_layers":[["dense_Dense15",0,0]]},"keras_version":"tfjs-layers 3.7.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense11/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[1,5],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[5,1],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[1],"dtype":"float32"}]}]}